# Все задачи текущего блока решите с помощью генераторов списков!

# Задание-1:
# Дан список, заполненный произвольными целыми числами.
# Получить новый список, элементы которого будут
# квадратами элементов исходного списка
# [1, 2, 4, 0] --> [1, 4, 16, 0]

# Задание-2:
# Даны два списка фруктов.
# Получить список фруктов, присутствующих в обоих исходных списках.

# Задание-3:
# Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# + Элемент кратен 3
# + Элемент положительный
# + Элемент не кратен 4


# Задание-1
# a = [1, 2, 4, 0]
# b = [i ** 2 for i in a]


# Задание-2
# a = ['Яблоки', 'Груша', 'Вишня', 'Оливки']
# b = ['Абрикос', 'Яблоки', 'Оливки', 'Авокадо', 'Яблоки']
# c = []
#
# В задании было написано "Все задачи текущего блока решите с помощью генераторов списков!"
for i in a:
    if i in b:
        c.append(i)
print(c)


# Задание-3
import random
a = [random.randint(0, 50) for i in range(20)]
print(a)

c = [i for i in a if i % 3 == 0 and i > 0 and not i % 4 == 0]
