# Задача-1:
# Напишите небольшую консольную утилиту,
# позволяющую работать с папками текущей директории.
# Утилита должна иметь меню выбора действия, в котором будут пункты:
# 1. Перейти в папку
# 2. Просмотреть содержимое текущей папки
# 3. Удалить папку
# 4. Создать папку
# При выборе пунктов 1, 3, 4 программа запрашивает название папки
# и выводит результат действия: "Успешно создано/удалено/перешел",
# "Невозможно создать/удалить/перейти"

# Для решения данной задачи используйте алгоритмы из задания easy,
# оформленные в виде соответствующих функций,
# и импортированные в данный файл из easy.py

import easy
import os


while True:
    answer = input('1. Перейти в папку\n2. Просмотреть содержимое текущей папки \n3. Удалить папку \n4. Создать папку \n>5. Выйти\n---------------------\nВаш выбор: ')
    if answer == '1':
        name = input('Введите название папки: ')

        try:
            easy.changeDir(name)
            print('Успешно перешел')
        except:
            print('Нет здесь такой папки')

    elif answer == '2':
        print(os.listdir())
    elif answer == '3':
        name = input('Введите название папки: ')

        try:
            os.rmdir(name)
            print('Успешно удалено')
        except:
            print('Нет здесь такой папки')

    elif answer == '4':
        try:
            name = input('Введите название папки: ')

            os.mkdir(name)
        except:
            print('Уже есть')
        print('Успешно создано')
    else:
        print('До свидания!')
